JeissonMartinez/tfm_master_ia/01_ING_DATOS/Capture_imagen/sdkconfig.defaults
# =============================================================================
# sdkconfig.defaults — Configuración ESP32-S3 Freenove CAM para captura
# Basado en el firmware de despliegue (03_ING_DESPLIEGUE/firmware)
# =============================================================================

# ===== Target =====
CONFIG_IDF_TARGET="esp32s3"

# ===== CPU 240 MHz =====
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ===== Flash: 16 MB, DIO =====
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ===== Partition Table Custom =====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== PSRAM: Octal 80 MHz (crítico para buffers JPEG de cámara) =====
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ===== Data Cache: 64 KB + 64B line (reduce PSRAM stalls) =====
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# ===== Compiler: -O2 =====
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ===== Stack sizes =====
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096

# ===== WiFi =====
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y

# ===== LWIP =====
CONFIG_LWIP_MAX_SOCKETS=12

# ===== HTTP Server (WebSocket + chunked transfer for MJPEG) =====
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# ===== FreeRTOS =====
CONFIG_FREERTOS_HZ=100

# ===== Logging =====
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ===== FAT Filesystem (for SD card) =====
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VOLUME_COUNT=2
